"""
เครื่องคำนวณค่าไฟฟ้าแบบขั้นบันได
เขียนโปรแกรมคำนวณค่าไฟฟ้าจากจำนวนหน่วยค่าไฟที่ใช้ไปในเดือนนั้น โดยฟังก์ชัน
calculate_electricity_cose(nuits)

ค่าไฟฟ้าขึ้นกับปริมาณการใช้งาน
จำนวนหน่วยที่ใช้             อัตราต่อหน่วย
1-50 หน่วยแรก                2.50 บาท
51-100 หน่วย                 3.00 บาท
101-200 หน่วย                3.50 บาท
มากกว่า 200 หน่วย              4.00 บาท

ให้คิดค่าบริการคงที่เพิ่มอีก 25 บาทต่อเดือน
เงื่อนไข
    *โปรแกรมแสดงเมนูซ้ำ
    *ผู้ใช้เลือก 1 เพื่อคำนวณค่าไฟฟ้า
    *ผู้ใช้เลือก 2 เพื่อออกจากโปรแกรม
    *หากเลือกเมนูอื่น ให้แจ้งว่าเลือกเมนูไม่ถูกต้อง
    *จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ
    *ให้แสดงรายละเอียดค่าไฟแต่ละช่วง
    
ตัวอย่างหน้าจอ
=====โปรแกรมคำนวณค่าไฟฟ้า=====
1.คำนวณค่าไฟฟ้า
2.ออกจากโปรแกรม
เลือกเมนู:1

กรอกจำนวนหน่วยไฟฟ้า: 120 

รายละเอียดค่าไฟฟ้า
1-50 หน่วย : 125.00 บาท
51-100 หน่วย : 150.00 บาท
101-120 หน่วย : 70.00 บาท
ค่าบริการ : 25.00 บาท
รวมค่าไฟฟ้าทั้งสิ้น : 370.00 บาท
"""

def calculate_electricity_cose(units):
    if units < 0:
        print("กรุณากรอกจำนวนหน่วยไฟฟ้าใหม่")
        
    if units <= 50:
        cost = units * 2.50
    elif units <= 100 :
        cost = (50 * 2.50) + ((units - 50) * 3.00)
    elif units <= 200:
        cost = (50 * 2.50) + (50 * 3.00) + ((units - 100) * 3.50)        
    else:
        cost = (50 * 2.50) + (50 * 3.00) + (100 * 3.50) + ((units - 200) * 4.00)
        
    sevice = 25
    total = cost + sevice
    
    print("รายละเอียดค่าไฟฟ้า")
    
    if units <= 50:
        print(f"1-{units:.0f} หน่วย : {units * 2.50:.2f} บาท")
    elif units <= 100 :
        print("1-50 หน่วย : 125 บาท")
        print(f"51-{units:.0f} หน่วย : {(units - 50) * 3.00:.2f} บาท")
    elif units <= 200:
        print("1-50 หน่วย : 125 บาท")
        print("51-100 หน่วย : 150 บาท")
        print(f"101-{units:.0f} หน่วย : {(units - 100) * 3.50:.2f} บาท")      
    else:
        print("1-50 หน่วย : 125 บาท")
        print("51-100 หน่วย : 150 บาท")
        print(f"201-{units:.0f} หน่วย : {(units - 200) * 4.00:.2f} บาท")     
    
    print(f"ค่าบริการ : {sevice} บาท")
    print(f"รวมค่าไฟฟ้าทั้งสิ้น : {total} บาท")
    
    return total

while True:
    print("===== โปรแกรมคำนวณค่าไฟฟ้า =====")
    print("1.คำนวณค่าไฟฟ้า")
    print("2.ออกจากโปรแกรม")
    choice = input("เลือกเมนู:")
    
    if choice == "1":
        units = float(input("กรุณากรอกจำนวนหน่วยไฟฟ้า:"))
        calculate_electricity_cose(units)
        
    elif choice == "2":
        break